Documents/Renault_ПотребностьПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ПотребностьПеремещения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦендр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_МаршрутыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеремещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыЗаявкиНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЛист</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ИсторияПереносовЗаявокНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ИсторияПереносовЗаявокНаПеремещение</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтараяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоваяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйЗаПеренос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ПотребностьПеремещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ПланПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПланПеремещения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перемещено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочиеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаписьЗаблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПотребностьПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ПотребностьПеремещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_ПотребностьПеремещения/Ext/ObjectModule.bsl
Перем СтараяДата;
Перем Ответственный;
Перем РабочиеОтметки;

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	СтараяДата = Ссылка.ЖелаемаяДатаПеремещения + (Ссылка.ВремяПоступления - Дата('00010101'));
	Ответственный = Ссылка.Продавец;

КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиЗаявку(ТекСтрока, НовоеВремяЗаписи) Экспорт
	
	СтараяДатаЗаписи = ЖелаемаяДатаПеремещения;
	СтароеВремяЗаписи = ВремяПоступления;
	
	НачатьТранзакцию();
	ТекстСообщения = "";
	Попытка
		ЖелаемаяДатаПеремещения = Дата(Год(НовоеВремяЗаписи.ДатаВремяПеремещения),Месяц(НовоеВремяЗаписи.ДатаВремяПеремещения),День(НовоеВремяЗаписи.ДатаВремяПеремещения));
		ВремяПоступления = Дата(1,1,1,Час(НовоеВремяЗаписи.ДатаВремяПеремещения),Минута(НовоеВремяЗаписи.ДатаВремяПеремещения),Секунда(НовоеВремяЗаписи.ДатаВремяПеремещения));
		Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = "Не удалось создать новую запись в журнале по причине:
		|" + ОписаниеОшибки();
	КонецПопытки;
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
		ТекстСообщения = "Заявка № " + Номер + " перенесена с " + Формат(СтароеВремяЗаписи, "ДФ=ЧЧ:мм") + Формат(СтараяДатаЗаписи, "ДФ='dd MMMM yyyy ""г.""'") + 
						" на " + Формат(ВремяПоступления, "ДФ=ЧЧ:мм") + " " + Формат(ЖелаемаяДатаПеремещения, "ДФ='dd MMMM yyyy ""г.""'");
	КонецЕсли;
	
	Renault_ОбщегоНазначения.СообщитьИнформациюПользователю(ТекстСообщения);
	
КонецПроцедуры

Процедура ИзменитьЗаявкуИзПланаПеремещений(ДопОборудование) Экспорт
	
	НачатьТранзакцию();
	ТекстСообщения = "";
	Попытка
		ДО = ДопОборудование;
		Записать();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = "Не удалось создать новую запись в журнале по причине:
		|" + ОписаниеОшибки();
	КонецПопытки;
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Renault_ОбщегоНазначения.СообщитьИнформациюПользователю(ТекстСообщения);
	
КонецПроцедуры

Процедура ЗаписатьИсториюПереносовЗаявки(СтараяДатаЗаписи, НовоеВремяЗаписи, Ответственный) Экспорт
	
	ЗаписьИсторияПереносов = РегистрыСведений.Renault_ИсторияПереносовЗаявокНаПеремещение.СоздатьМенеджерЗаписи();
	ЗаписьИсторияПереносов.ЗаявкаНаПеремещение = Ссылка;
	ЗаписьИсторияПереносов.СтараяДатаПередачи = СтараяДатаЗаписи;
	ЗаписьИсторияПереносов.НоваяДатаПередачи = НовоеВремяЗаписи;
	ЗаписьИсторияПереносов.ОтветственныйЗаПеренос = ПараметрыСеанса.Пользователь;
	ЗаписьИсторияПереносов.Продавец = Ответственный;
	ЗаписьИсторияПереносов.Период = ТекущаяДата();
	ЗаписьИсторияПереносов.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Для Каждого СтрокаТЗ из Автомобили Цикл
	//	Менеджер = РегистрыСведений.Renault_ПланПеремещения.СоздатьМенеджерЗаписи();
	//	Менеджер.ПотребностьПеремещения = Ссылка;
	//	Менеджер.Автомобиль = СтрокаТЗ.Автомобиль;
	//	Менеджер.ВЗаявке = Истина;
	//	Менеджер.ДатаЗаписи = Дата;
	//	Менеджер.ДатаПлан = ЖелаемаяДатаПеремещения;
	//	Менеджер.Комментарий = Комментарий;
	//	Менеджер.Ответственный = Автор;
	//	Менеджер.РабочийЛист = СтрокаТЗ.РабочийЛист;
	//	Менеджер.СкладОтправитель = Маршрут.СкладОтправитель;
	//	Менеджер.СкладПолучатель = Маршрут.СкладПолучатель;
	//	Менеджер.Записать();
	//КонецЦикла;
	
	РабочиеОтметки = Неопределено;
	НаборЗаписей = РегистрыСведений.Renault_ПланПеремещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПотребностьПеремещения.Установить(Ссылка);
	
	НаборЗаписей.Прочитать();
	Для каждого Запись из НаборЗаписей цикл
		РабочиеОтметки = запись.РабочиеОтметки;
	КонецЦикла;
	
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.Renault_ПланПеремещения.СоздатьНаборЗаписей();
	текДатаПоступления = ЖелаемаяДатаПеремещения + (ВремяПоступления - Дата('00010101'));
	НаборЗаписей.Отбор.ПотребностьПеремещения.Установить(Ссылка);
	
	Для Каждого СтрокаТЗ из Автомобили Цикл

		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.ДатаПлан = текДатаПоступления;
		НоваяСтрока.Автомобиль = СтрокаТЗ.Автомобиль;
		НоваяСтрока.РабочийЛист = СтрокаТЗ.РабочийЛист;
		НоваяСтрока.Контрагент = СтрокаТЗ.Контрагент;
		НоваяСтрока.ДатаЗаписи = Дата;
		НоваяСтрока.ВЗаявке = Истина;
		НоваяСтрока.Комментарий = Комментарий;
		НоваяСтрока.Продавец = Продавец;
		НоваяСтрока.Ответственный = Автор;
		НоваяСтрока.СкладОтправитель = Маршрут.СкладОтправитель;
		НоваяСтрока.СкладПолучатель = Маршрут.СкладПолучатель;
		НоваяСтрока.ПотребностьПеремещения = Ссылка;
		НоваяСтрока.РабочиеОтметки = РабочиеОтметки;
		НоваяСтрока.ДопОборудование = ДО;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Если СтараяДата <> текДатаПоступления И НЕ СтараяДата = Дата(1,1,1) Тогда
		
		//делаем запись в регистр "История переносов заявок на перемещение"
		ЗаписатьИсториюПереносовЗаявки(СтараяДата, текДатаПоступления, Ответственный);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыСведений.Renault_ПланПеремещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПотребностьПеремещения.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры
